
## :white_check_mark: Apply Succeeded (koyashiro.sh)

[CI link](https://github.com/koyashiro/infra/actions/runs/8789415241)



<pre><code>Apply complete! Resources: 6 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.cname_dotfiles will be created
  + resource "cloudflare_record" "cname_dotfiles" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "dotfiles"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "koyashiro-sh.pages.dev"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.cname_root will be created
  + resource "cloudflare_record" "cname_root" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "koyashiro-sh.pages.dev"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.txt_dkim will be created
  + resource "cloudflare_record" "txt_dkim" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "*._domainkey"
      + proxiable       = (known after apply)
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=DKIM1; p="
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.txt_dmarc will be created
  + resource "cloudflare_record" "txt_dmarc" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_dmarc"
      + proxiable       = (known after apply)
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=DMARC1; p=reject; sp=reject; adkim=s; aspf=s;"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.txt_keybase_site_verification will be created
  + resource "cloudflare_record" "txt_keybase_site_verification" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 1
      + type            = "TXT"
      + value           = "keybase-site-verification=NNZVaBOMg3ALJyId1SRe4LGb6lxxYQr8Nau-yf1ut4w"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.txt_spf will be created
  + resource "cloudflare_record" "txt_spf" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=spf1 -all"
      + zone_id         = (sensitive value)
    }

Plan: 6 to add, 0 to change, 0 to destroy.
cloudflare_record.txt_dkim: Creating...
cloudflare_record.txt_keybase_site_verification: Creating...
cloudflare_record.txt_dmarc: Creating...
cloudflare_record.cname_root: Creating...
cloudflare_record.txt_spf: Creating...
cloudflare_record.cname_dotfiles: Creating...
cloudflare_record.txt_dkim: Creation complete after 1s [id=1a6ba56e5b9a78718f87331fdcb3343f]
cloudflare_record.txt_dmarc: Creation complete after 1s [id=1810631b72c3431f981addd6c8fe7c1d]
cloudflare_record.txt_keybase_site_verification: Creation complete after 2s [id=2b451f81bcbfaacecfe3589c5a35d3dd]
cloudflare_record.txt_spf: Creation complete after 2s [id=6cb3c32f6b1226ff8bf51a5b52eaabe8]
cloudflare_record.cname_dotfiles: Creation complete after 2s [id=44a96e97087e1aff0a0c11ea7a6bebaa]
cloudflare_record.cname_root: Creation complete after 3s [id=34c726f868e9cbc28c3ffa748cff260c]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 6 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform-apply","PRNumber":170,"Program":"tfcmt","SHA1":"6d0a139f12b7867bec16464c65645f9fce648d91","Target":"koyashiro.sh","Vars":{},"WorkflowName":"terraform"} -->